; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	thermograph2 - mode
	image0 - mode
	infrared3 - mode
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	Star9 - direction
	GroundStation5 - direction
	Star4 - direction
	Star2 - direction
	Star0 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star0)
	(supports instrument5 thermograph2)
	(supports instrument5 image0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star9)
	(supports instrument6 thermograph2)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(supports instrument8 infrared3)
	(supports instrument8 image0)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet14)
)
(:goal (and
	(pointing satellite1 Planet14)
	(pointing satellite2 Phenomenon15)
	(have_image Planet10 image0)
	(have_image Planet11 infrared3)
	(have_image Planet12 image0)
	(have_image Planet14 thermograph2)
	(have_image Phenomenon15 image0)
	(have_image Phenomenon16 thermograph2)
))

)

; plan
1. (turn_to satellite2 star9 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star9)
   goals met: 0 of 8
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 8
3. (calibrate satellite2 instrument5 star9)
   added: (calibrated instrument5)
   goals met: 0 of 8
4. (turn_to satellite2 planet11 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet11)
   goals met: 0 of 8
5. (take_image satellite2 planet11 instrument5 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 1 of 8
6. (turn_to satellite2 planet10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet10)
   goals met: 1 of 8
7. (take_image satellite2 planet10 instrument5 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 8
8. (turn_to satellite2 phenomenon16 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon16)
   goals met: 2 of 8
9. (turn_to satellite1 planet14 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet14)
   goals met: 3 of 8
10. (take_image satellite2 phenomenon16 instrument5 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 4 of 8
11. (turn_to satellite2 planet12 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 planet12)
   goals met: 4 of 8
12. (take_image satellite2 planet12 instrument5 image0)
   added: (have_image planet12 image0)
   goals met: 5 of 8
13. (turn_to satellite2 planet14 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet14)
   goals met: 5 of 8
14. (take_image satellite2 planet14 instrument5 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 6 of 8
15. (turn_to satellite2 phenomenon15 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 phenomenon15)
   goals met: 7 of 8
16. (take_image satellite2 phenomenon15 instrument5 image0)
   added: (have_image phenomenon15 image0)
   goals met: 8 of 8
